app/controllers/api/posts_controller.rb

    def fetch_posts
      # Individually apply tags to url
      @post_urls = url_query.each do |url|
        if Post.saved?(url)
          if Post.expired?(url)
            payload = JSON.parse(RestClient.get(url))
            Post.find_by('url': url).update!(url: url, payload: payload, updated_at: Time.now)
          end
        else
          payload = JSON.parse(RestClient.get(url))
          Post.create(url: url, payload: payload)
---
INSERT INTO "posts" ("url", "payload", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["url", "https://api.hatchways.io/assessment/blog/posts?tag=food"], ["payload", "{\"posts\":[]}"], ["created_at", "2022-04-22 23:22:14.849090"], ["updated_at", "2022-04-22 23:22:14.849090"]]
SELECT "posts".* FROM "posts" WHERE "posts"."url" = $1 LIMIT $2  [["url", "https://api.hatchways.io/assessment/blog/posts?tag=culture"], ["LIMIT", 1]]
UPDATE "posts" SET "updated_at" = $1 WHERE "posts"."id" = $2  [["updated_at", "2022-04-24 13:41:29.656128"], ["id", 1]]
INSERT INTO "posts" ("url", "payload", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"