app/models/post.rb

  def self.saved?(url)
    @urls = []
    Post.all.each do |post|
      @urls.push(post['url'])
---
INSERT INTO "posts" ("url", "payload", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
SELECT "posts".* FROM "posts"

  def self.expired?(url)
    cur_time = Time.now
    expiration = ''
    Post.all.each do |post|
      if post['url'].include?(url)
---
SELECT "posts".* FROM "posts"

  def self.search_url(url)
    bulk_posts = []
    Post.all.each do |post|
      if url.any? { |i| post['url'].include?(i) }
---
SELECT "posts".* FROM "posts"

  def self.search_posts(posts, tags)
    post_array = []
    posts.each do |post|
      post.payload['posts'].each do |post_data|
---
SELECT "posts".* FROM "posts"